planos/paridade_baseline_escrita.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Paridade Baseline Escrita">
      <stringProp name="TestPlan.comments">Plano de criacao controlada com nomes unicos por thread e iteracao para evitar 409.</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SPRING_HOST" elementType="Argument"><stringProp name="Argument.name">SPRING_HOST</stringProp><stringProp name="Argument.value">localhost</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="SPRING_PORT" elementType="Argument"><stringProp name="Argument.name">SPRING_PORT</stringProp><stringProp name="Argument.value">8080</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="PYTHON_HOST" elementType="Argument"><stringProp name="Argument.name">PYTHON_HOST</stringProp><stringProp name="Argument.value">localhost</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="PYTHON_PORT" elementType="Argument"><stringProp name="Argument.name">PYTHON_PORT</stringProp><stringProp name="Argument.value">8000</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
          <elementProp name="PROTO" elementType="Argument"><stringProp name="Argument.name">PROTO</stringProp><stringProp name="Argument.value">http</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG_SPRING_WRITE">
        <stringProp name="ThreadGroup.on_sample_error">stopthread</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">10</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults Spring"><stringProp name="HTTPSampler.domain">${SPRING_HOST}</stringProp><stringProp name="HTTPSampler.port">${SPRING_PORT}</stringProp><stringProp name="HTTPSampler.protocol">${PROTO}</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments"><collectionProp name="Arguments.arguments"/></elementProp></ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Spring JSON"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Payload Cursos"><stringProp name="filename">../data/payload_cursos.csv</stringProp><stringProp name="variableNames">categoria,descricao,carga_horaria</stringProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="delimiter">,</stringProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Create Course">
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <stringProp name="HTTPSampler.path">/courses</stringProp><stringProp name="HTTPSampler.method">POST</stringProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs"><collectionProp name="HTTPFileArgs.files"/></elementProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="dados" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">dados</stringProp><stringProp name="Argument.value">{&quot;title&quot;:&quot;Curso JMeter ${__threadNum}-${__counter(FALSE,)}&quot;,&quot;category&quot;:&quot;${categoria}&quot;,&quot;description&quot;:&quot;${descricao}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Spring Course ID"><stringProp name="JSONPostProcessor.referenceNames">SPRING_COURSE_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.dados.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Create Module">
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <stringProp name="HTTPSampler.path">/courses/${SPRING_COURSE_ID}/modules</stringProp><stringProp name="HTTPSampler.method">POST</stringProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs"><collectionProp name="HTTPFileArgs.files"/></elementProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="dados" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">dados</stringProp><stringProp name="Argument.value">{&quot;name&quot;:&quot;Modulo JMeter ${__threadNum}-${__counter(FALSE,)}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Spring Module ID"><stringProp name="JSONPostProcessor.referenceNames">SPRING_MODULE_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.dados.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Create Lesson">
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <stringProp name="HTTPSampler.path">/modules/${SPRING_MODULE_ID}/lessons</stringProp><stringProp name="HTTPSampler.method">POST</stringProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs"><collectionProp name="HTTPFileArgs.files"/></elementProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="dados" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.name">dados</stringProp><stringProp name="Argument.value">{&quot;name&quot;:&quot;Aula JMeter ${__threadNum}-${__counter(FALSE,)}&quot;,&quot;contentEditor&quot;:&quot;Conteudo de benchmark.&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp></elementProp></collectionProp></elementProp>
        </HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Spring Lesson ID"><stringProp name="JSONPostProcessor.referenceNames">SPRING_LESSON_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.dados.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Spring Create Assessment"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{&quot;questions&quot;:[{&quot;statement&quot;:&quot;Pergunta ${__threadNum}-${__counter(FALSE,)}?&quot;,&quot;points&quot;:1,&quot;alternatives&quot;:[{&quot;text&quot;:&quot;A&quot;,&quot;correct&quot;:false},{&quot;text&quot;:&quot;B&quot;,&quot;correct&quot;:true},{&quot;text&quot;:&quot;C&quot;,&quot;correct&quot;:false},{&quot;text&quot;:&quot;D&quot;,&quot;correct&quot;:false}]}]}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/modules/${SPRING_MODULE_ID}/quiz</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG_PYTHON_WRITE">
        <stringProp name="ThreadGroup.on_sample_error">stopthread</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">10</stringProp></elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults Python"><stringProp name="HTTPSampler.domain">${PYTHON_HOST}</stringProp><stringProp name="HTTPSampler.port">${PYTHON_PORT}</stringProp><stringProp name="HTTPSampler.protocol">${PROTO}</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments"><collectionProp name="Arguments.arguments"/></elementProp></ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Python Login CSV"><stringProp name="filename">../data/professores_login.csv</stringProp><stringProp name="variableNames">email,senha</stringProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="delimiter">,</stringProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.currentThread</stringProp></CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Payload Cursos"><stringProp name="filename">../data/payload_cursos.csv</stringProp><stringProp name="variableNames">categoria,descricao,carga_horaria</stringProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="delimiter">,</stringProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Login Once"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Python Login"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{&quot;email_ou_usuario&quot;:&quot;${email}&quot;,&quot;senha&quot;:&quot;${senha}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
          <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract ACCESS_TOKEN"><stringProp name="JSONPostProcessor.referenceNames">ACCESS_TOKEN</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.access_token</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 200"><collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        </hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth Header"><collectionProp name="HeaderManager.headers"><elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${ACCESS_TOKEN}</stringProp></elementProp></collectionProp></HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Python Create Course"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{&quot;titulo&quot;:&quot;Curso JMeter ${__threadNum}-${__counter(FALSE,)}&quot;,&quot;categoria&quot;:&quot;${categoria}&quot;,&quot;descricao&quot;:&quot;${descricao}&quot;,&quot;carga_horaria&quot;:&quot;${carga_horaria}&quot;,&quot;requer_endereco&quot;:false,&quot;requer_genero&quot;:false,&quot;requer_idade&quot;:false}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/v1/cursos</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Python Course ID"><stringProp name="JSONPostProcessor.referenceNames">PY_CURSO_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Python Create Module"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/v1/cursos/${PY_CURSO_ID}/modulos</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Python Module ID"><stringProp name="JSONPostProcessor.referenceNames">PY_MODULO_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Python Create Lesson"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{&quot;nome&quot;:&quot;Aula JMeter ${__threadNum}-${__counter(FALSE,)}&quot;,&quot;conteudo_ck_editor&quot;:&quot;&lt;p&gt;Conteudo de benchmark.&lt;/p&gt;&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/v1/modulos/${PY_MODULO_ID}/aulas</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Python Lesson ID"><stringProp name="JSONPostProcessor.referenceNames">PY_AULA_ID</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.id</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">-1</stringProp></JSONPostProcessor><hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Python Create Assessment"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><stringProp name="Argument.value">{&quot;mostrar_respostas_erradas&quot;:false,&quot;mostrar_respostas_corretas&quot;:false,&quot;mostrar_valores&quot;:true,&quot;perguntas&quot;:[{&quot;enunciado&quot;:&quot;Pergunta ${__threadNum}-${__counter(FALSE,)}?&quot;,&quot;pontos&quot;:1,&quot;alternativas&quot;:[{&quot;texto&quot;:&quot;A&quot;,&quot;correta&quot;:false},{&quot;texto&quot;:&quot;B&quot;,&quot;correta&quot;:true},{&quot;texto&quot;:&quot;C&quot;,&quot;correta&quot;:false},{&quot;texto&quot;:&quot;D&quot;,&quot;correta&quot;:false}]}]}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/v1/modulos/${PY_MODULO_ID}/prova/manual</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert 201"><collectionProp name="Asserion.test_strings"><stringProp name="1">201</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>